// GhostHunter.cpp : This file contains the 'main' function. Program execution begins and ends there.
//

#include "pch.h"
#include <iostream>
#include <stdlib.h>
#include <windows.h>
#include <string>
#include <time.h>

using namespace std;
void FirstChoice();//Первый выбор игрока, который отправляет в функцию навигации, либо завершает игру.
void Navigation();
void ConsolSize(); // Утснаваливает размер окна консоли. (подглядел в гугле, но пришлось повозится)
void BigText();// Выводит Лого игры.
void Disclaimer();// Выводит прочее при запуске игры.
void StartMenu();
void StartLocations();// Первая локация перед входом в замок, которая худо бедно объясняет пользователю, что к чему.
void TextWindow();// Рисует полоску в окне с текстом. 
void Die(); // Выводи на экран сообщение при смерти. 
void Interface();//Интерфейс игрока, отображает здоровье, ману, снаряжение и карту.
void Action();
void GenerateItem();
void ItemBox();
void Fight(int mobHeals,int mobDamage);
//Итемы (вещи)

//комнаты
void Chest();

void Room_Clear_Center();
void Room_Clear_Left();
void Room_Clear_Right();

void Room_A1();
void Room_A2();
void Room_A3();
void Room_A4();
void Room_A5();
void Room_A6();
void Room_A7();
void Room_A8();
void Room_A9();
void Room_A10();
void Room_A11();
void Room_A12();
void Room_A13();
void Room_A14();
void Room_A15();

void Specialization(bool special);

bool chekCloseChest[15]{ true , true ,true ,true ,true ,true ,true ,true ,true ,true ,true ,true ,true ,true ,true  };
int setItem[11];
int z = 1;
int playerHels = 3;
int choice, firstChoice;
int key, setNavigation, savePosition, choiceItem;
char x = 127;
int expirience, mobExp, lvl;
bool speciolization;

string playerName, sayItem, mobName;
string newItem[11];
//ох тут будет ща полная жопа xDDD(описание навыков)
string ratSkils[5]{ "Порез", "Сквозной порез", "Фаршмашина","Изничтожение","Ультимативная смерть" };
string magSkils[5]{ "Огненая стрела", "Огнехлыст", "Костяные шипы","Смерть с небес","Армагедон" };
string ratEqip[4]{ "Меч", "Коса", "Броня", "Шлем" };
string magEqip[4]{ "Посох", "Некрономикон", "Мантия", "Сфера стихий" };
string skils[4];
//"Яблоко","Зелье","Элексир","Свиток - Фаербол","Свиток Молния","Свиток ледяная стрела","Серебрянные дротики","Святая бомба", "Освященый сюрикен"
int itemDamage[10]{2,7,7,5,7,3,5,7,3,0};
//"Порез", "Сквозной порез", "Фаршмашина","Изничтожение","Ультимативная смерть","Огненая стрела", "Огнехлыст", "Костяные шипы","Смерть с небес","Армагедон"
int skilsDamage[5]{1,5,9,14,20};
int eqipDamage[8]{1,4,2,4,1,4,2,4};


int main()
{
	
	ConsolSize();
	setlocale(LC_ALL, "russian");

	Disclaimer();
	StartMenu();
	if (playerName == "satan") {
		key += 5;
	}
	FirstChoice();
	Room_Clear_Right();






}

void ConsolSize() {

	HANDLE out_handle = GetStdHandle(STD_OUTPUT_HANDLE);
	COORD crd = { 120,45 };
	SMALL_RECT src = { 0, 0, crd.X - 1, crd.Y - 1 };
	SetConsoleWindowInfo(out_handle, true, &src);
	SetConsoleScreenBufferSize(out_handle, crd);

}
void Disclaimer() {
	BigText();
	cout << endl << endl;
	cout << "\t\t\t\t\t";
	cout << "\t\t\t\t\t";
	cout << "(с) Компьютерная академи ШАГ. Воронеж" << endl;
	cout << "\t\t\t\t\t";
	cout << "\t\t\t\t\t";
	cout << "(c) Старинин Андрей, Питецкий Владимир" << endl;
	cout << endl;
	cout << "\t\t\t\t";
	cout << "		>>> Press Enter! <<<\n\n\n\n";
	system("pause");
	system("cls");
}
void TextWindow() {
	cout << "\t";
	for (int i = 0; i < 100; i++)
	{
		cout << '#';
	}
	cout << endl;

}

void BigText() {

	char bigStringGost[7][25] = {
		{ '#','#','#','#',' ','#',' ',' ','#',' ','#','#','#','#',' ','#','#','#','#',' ','#','#','#','#','#' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ','#',' ',' ',' ','#',' ',' ' },
		{ '#',' ',' ',' ',' ','#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ',' ',' ',' ',' ','#',' ',' ' },
		{ '#',' ','#','#',' ','#','#','#','#',' ','#',' ',' ','#',' ','#','#','#','#',' ',' ',' ','#',' ',' ' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ','#',' ',' ',' ',' ','#',' ',' ',' ','#',' ',' ' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ','#',' ',' ',' ','#',' ',' ' },
		{ '#','#','#','#',' ','#',' ',' ','#',' ','#','#','#','#',' ','#','#','#','#',' ',' ',' ','#',' ',' ' }
	};
	char bigStringHuner[7][32] = {
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#','#','#','#',' ','#','#','#','#','#' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ',' ','#',' ',' ',' ','#' },
		{ '#','#','#','#',' ','#',' ',' ','#',' ','#','#',' ',' ','#',' ',' ',' ','#',' ',' ',' ','#','#','#',' ',' ','#','#','#','#','#' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ','#',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ',' ','#','#','#',' ',' ' },
		{ '#',' ',' ','#',' ','#',' ',' ','#',' ','#',' ',' ','#','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#',' ',' ','#',' ' },
		{ '#',' ',' ','#',' ','#','#','#','#',' ','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ',' ','#','#','#','#',' ','#',' ',' ',' ','#' }
	};
	cout << "\t\t\t\t\t";
	for (int t = 0; t < 7; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << bigStringGost[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}

	cout << endl;
	cout << "\t\t\t\t\t";
	for (int t = 0; t < 7; t++)
	{
		for (int i = 0; i < 32; i++)
		{
			cout << bigStringHuner[t][i];
		}
		cout << endl << "\t\t\t\t\t";;
	}

}


void StartMenu() {
	BigText();
	cout << endl << endl;
	cout << "\t\t\t\t";
	cout << "\t Сделайте свой первый выбор!\n" << "\t\t\t\t\t\t" << "1) Новая Игра!\n" << "\t\t\t\t\t\t" << "2) Выход\n\n";
	cin >> choice;

	switch (choice)
	{
	case 1:
		StartLocations();

		break;
	case 2:
		break;
	default:
		cout << "Неверный выбор!" << endl;
		main();
	}

}

void StartLocations() {
	int choiceClass;
	system("cls");

	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_"; - 'это разметка текста.
	cout << "\t|                                                                                                  |";
	cout << "\n\t|\tДобро пожаловать в мир приключений. Прекрасный мир, полный опасностей, зомби               |" << endl << "\t|";
	cout << "и кровожадных монстров. Вы отважный искатель приключений, отправились в заброшенный замок,        |" << endl << "\t|";
	cout << "дабы спасти дракона. Дракона, что заточен в башне на вершине замка. Злобная принцесса,            |" << endl << "\t|";
	cout << "обманом заманила дракона в башню, где он попал в ловушку. Магические цепи тут же его              |" << endl << "\t|";
	cout << "сковали и прижали к полу. И чем сильнее пытался вырваться дракон, тем сильнее сжимались цепи.     |" << endl << "\t|";
	cout << "Сжимались до хруста костей. И в итоге дракон сдался.                                              |" << endl;
	cout << "\t|                                                                                                  |" << endl << "\t|";
	cout << "Испльзуя кровь дракона как источник бессмертия, и как материал для ужасающих эксперементов,       |" << endl << "\t|";
	cout << "принцесса сама не заметила, как превратилась в ужаснейшее чудовище. И все подданые, все все,      |" << endl << "\t|";
	cout << "кто населял замок, со временем стали монстрами, неупокоенными душами, тенями, что вынужденны      |" << endl << "\t|";
	cout << "скитатся по замку вечность. Таково проклятие дракона...                                           |" << endl;
	cout << "\t|                                                                                                  |" << endl;
	TextWindow();

	system("pause");
	system("cls");

	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
	cout << "\t|                                                                                                  |";
	cout << "\n\t|\tИ так, старнник, теперь узнав об этой истории, вы не можете пройти мимо!                   |" << endl << "\t|";
	cout << "Вам придется войти в замок, пройти три этажа, сразив на каждом своего босса, взабраться на        |" << endl << "\t|";
	cout << "башню, победить принцессу и освободить дракона. Освободить дракона любой ценой!                   |" << endl << "\t|";
	cout << "                                                                                                  |" << endl << "\t|";
	cout << "\tВ процессе приключения, вам будут встречать предметы, которые помогут вам в сражениях.     |" << endl << "\t|";// Смещение центровки на 5 символов из-за табуляции в начале!
	cout << "Так же, вы сможите отыскать сундуки с сокровищами, но что бы открыть их, понадобятся ключи.       |" << endl << "\t|";
	cout << "                                                                                                  |" << endl << "\t|";
	cout << "\tДля начала, давайте познакомимся!                                                          |" << endl << "\t|";
	cout << "                                                                                                  |" << endl;
	TextWindow();

	cout << "\t\t\t\tВведите имя (на английском) :";
	cin >> playerName;

	system("pause");
	system("cls");

	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_12345678|__|"; - 'это разметка текста.
	cout << "\t|                                                                                                  |";
	cout << "\n\t|\tОтлично " << playerName << " А теперь выбери класс :" << endl << "\t|";
	cout << "\t1) Воин.                                                                                   |" << endl << "\t|";
	cout << "\t2) Маг.                                                                                    |" << endl << "\t|";
	cout << "                                                                                                  |" << endl << "\t|";
	cout << "\tВыбирай с умом. От выбора зависят харрактеристики предметов.                               |" << endl << "\t|";
	cout << "Маг получает усиление используя магические предметы, а воин ратные соответсвенно.                 |" << endl << "\t|";
	cout << "Также маг менее эфективно использует ратные предметы, как и воин магические.                      |" << endl << "\t|";
	cout << "У некоторых босов, может быть слабость или спротивление к магии, или ратному вооружению           |" << endl << "\t|";
	cout << "                                                                                                  |" << endl;
	TextWindow();

	cout << "\t\t\t\tВведите номер класса :";
	cin >> choiceClass;
	if (choiceClass == 1)
	{
		speciolization = false;
	}
	else
	{
		speciolization = true;
	}
	Specialization(speciolization);


	system("pause");
	system("cls");

	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста. Выровняй разметку по cout.
	cout << "\t|                                                                                                  |";
	cout << "\n\t|\tОтлично " << playerName << ", теперь ты полностью готов. " << endl << "\t|";
	cout << "Ты стоишь на пороге врат в замок. Что ожидает за ними? Смерть? Сокровища? Может быть любовбь?     |" << endl << "\t|";
	cout << "Решишся ли ты отворить врата? Или поддашся страху и убежишь как пугливый котенок?                 |" << endl << "\t|";
	cout << "Сделай выбор!                                                                                     |" << endl << "\t|";
	cout << "                                                                                                  |" << endl << "\t|";
	cout << "\t1) Распахнуть обветшалые врата ударом с ноги!                                              |" << endl << "\t|";
	cout << "\t2) Бежать как испуганный котенок...                                                        |" << endl << "\t|";
	cout << "                                                                                                  |" << endl;
	TextWindow();

	cout << "\t" << playerName << " выбирай! (Выбор производится вводом номера варианта) : ";
	cin >> firstChoice;
	system("pause");
	system("cls");

}

void FirstChoice() {

	cout << endl;
	if (firstChoice == 1)
	{
		TextWindow();
		//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
		cout << "\t|                                                                                                  |" << endl << "\t|";
		cout << "\tРезким и жестким ударом ноги, трухлявая дверь сорвалась с петель. Спертый воздуг резко     |" << endl << "\t|";
		cout << "ударил в лицо, грязные окна не впускали свет внутрь помещения, а потолок украшала паутина.        |" << endl << "\t|";
		cout << "Сердце забилось чаще, но вы не струсили, и сделали свой первый шаг. Шаг в неведанное, в пустоту.  |" << endl << "\t|";
		cout << "                                                                                                  |" << endl << "\t|";
		cout << "\tШаг на встречу опасности...                                                                |" << endl << "\t|";
		cout << "                                                                                                  |" << endl;
		TextWindow();
		system("pause");
		system("cls");
		Room_A2();
	}
	else
	{
		TextWindow();
		//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
		cout << "\t|                                                                                                  |" << endl << "\t|";
		cout << "\tТы стоял под гнетом стен ужасающего замка. Страшные звуки доносились из его глубин.        |" << endl << "\t|";
		cout << "В твоей голове, по кругу, мелькала одни лишь мысль - \"Опасность!\" Ты понимаешь, что               |" << endl << "\t|";
		cout << "оставаться тут нелья. И приняв единственное верное решение, кидаешься на утек.                    |" << endl << "\t|";
		cout << "                                                                                                  |" << endl << "\t|";
		cout << "\tОднако не пробежав и 20 метров, спотыкаешься о корень и падаешь в грязь. Ты в ужасе        |" << endl << "\t|";
		cout << "поднимаешь лицо. Вязкая грязь залила глаза, ты видишь силуэт над собой, но не можешь разобрать,   |" << endl << "\t|";
		cout << "что видишь. Только странные чавкающие звуки доносятся до тебя...                                  |" << endl << "\t|";
		cout << "                                                                                                  |" << endl << "\t|";
		cout << "  Тупая боль пробила грудь, и слезы неволей вырвались на ружу, небеса разорвал оглушающий крик.   |" << endl << "\t|";
		cout << "Это кречишь ты - " << playerName << "...И это последние мгновения твоей жизни...                        " << endl << "\t|";
		cout << "\tОстрая кость, что служила монстру рукой, или была ей когда то, пронзила тебя на сквозь...  |" << endl;
		TextWindow();
		Die();
		main();
	}
	system("pause");
	system("cls");

}

void Die() {
	char youDie_YOU[6][15]{
		{ '#',' ',' ',' ','#',' ','#','#','#','#',' ','#',' ',' ','#' },
		{ ' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','#' },
		{ ' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#',' ',' ','#' },
		{ ' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#',' ',' ','#' },
		{ ' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#',' ',' ','#' },
		{ ' ',' ','#',' ',' ',' ','#','#','#','#',' ','#','#','#','#' }
	};

	char youDie_DIE[6][11]{
		{ '#','#',' ',' ',' ','#',' ','#','#','#','#' },
		{ '#',' ','#',' ',' ',' ',' ','#',' ',' ','#' },
		{ '#',' ',' ','#',' ','#',' ','#',' ',' ',' ' },
		{ '#',' ',' ','#',' ','#',' ','#','#','#',' ' },
		{ '#',' ',' ','#',' ','#',' ','#',' ',' ',' ' },
		{ '#','#','#',' ',' ','#',' ','#','#','#','#' }
	};

	char youDie_SKULL[12][8]{
		{ ' ',' ','#','#','#','#',' ',' ' },
		{ ' ','#','#','#','#','#','#',' ' },
		{ ' ','#',' ','#','#',' ','#',' ' },
		{ ' ','#','#','#','#','#','#',' ' },
		{ ' ',' ','*','#','#','*',' ',' ' },
		{ '#',' ',' ','#','#',' ',' ','#' },
		{ '#','*',' ',' ',' ',' ','*','#' },
		{ ' ',' ','*',' ',' ','*',' ',' ' },
		{ ' ',' ',' ','#','#',' ',' ',' ' },
		{ ' ',' ','*',' ',' ','*',' ',' ' },
		{ '#','*',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ','#' }

	};

	cout << "\t\t\t\t\t";
	for (int t = 0; t < 6; t++)
	{
		for (int i = 0; i < 15; i++)
		{
			cout << youDie_YOU[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}

	cout << endl;
	cout << "\t\t\t\t\t  ";

	for (int t = 0; t < 6; t++)
	{
		for (int i = 0; i < 11; i++)
		{
			cout << youDie_DIE[t][i];
		}
		cout << endl << "\t\t\t\t\t  ";;
	}
	cout << endl << endl;

	cout << "\t\t\t\t\t   ";

	for (int t = 0; t < 12; t++)
	{
		for (int i = 0; i < 8; i++)
		{
			cout << youDie_SKULL[t][i];
		}
		cout << endl;
		cout << "\t\t\t\t\t   ";
	}
	cout << endl;
	cout << "\t\t\t\t";

	cout << "1) Новая Игра!\n" << "\t\t\t\t" << "2) Выход\n\n";
	cin >> choice;

	switch (choice)
	{
	case 1:
		StartLocations();

		break;
	case 2:
		break;
	default:
		cout << "Неверный выбор!" << endl;
		main();
	}



}
void GenerateItem() {
	string item[11]{ "Кек, десь ни чего нет :-(", "Яблоко","Зелье","Элексир","Свиток - Фаербол","Свиток Молния","Свиток ледяная стрела","Серебрянные дротики","Святая бомба", "Освященый сюрикен","Кек, десь ни чего нет :-(" };
	srand(time(NULL));//Обрати внимание!
	int x = rand() % 11;
	if (z < 22)
	{
		sayItem = item[x];
		newItem[x] = item[x];

		setItem[x] = +1;
		z++;
	}
	else {
		cout << "Вы не можете унести больше вещей, увы. Вам пришлось бросить эту затею!";
	}

}

/*void ItemBox(){

	switch (setItem) {
	case setItem[0]://яблоко
	case setItem[1]://Зелье
	case setItem[2]://Элексир
	case setItem[3]:
	case setItem[4]:
	case setItem[5]:
	case setItem[6]:
	case setItem[7]:
	case setItem[8]:
	case setItem[9]:
	case setItem[10]:
	case setItem[11]:


}*/

void Navigation() {
	switch (setNavigation)
	{
	case 0:
		Chest();
		break;
	case 1:
		Room_A1();
		break;
	case 2:
		Room_A2();
		break;
	case 3:
		Room_A3();
		break;
	case 4:
		Room_A4();
		break;
	case 5:
		Room_A5();
		break;
	case 6:
		Room_A6();
		break;
	case 7:
		Room_A7();
		break;
	case 8:
		Room_A8();
		break;
	case 9:
		Room_A9();
		break;
	case 10:
		Room_A10();
		break;
	case 11:
		Room_A11();
		break;
	case 12:
		Room_A12();
		break;
	case 13:
		Room_A13();
		break;
	case 14:
		Room_A14();
		break;
	case 15:
		Room_A15();
		break;
	case 101:
		Room_Clear_Center();
		break;
	case 102:
		Room_Clear_Left();
		break;
	case 103:
		Room_Clear_Right();
		break;

	default:
		break;
	}

}

void Interface() {
	cout << "Ваш уровень : " << lvl << "." << endl;
	cout << "\n\n\t\tУ вас в наличии : ";

	cout << "Колличество ключей : " << key << "." << endl; 
	cout << "Боевой опыт : " << expirience << "." << endl;
	
	for (int i = 1; i < 11; i++)
	{
		if (setItem[i] > 0) {

			cout << newItem[i]<<" " <<setItem[i] << " шт. ";
		}

	}
	
}
////////////////////////////////////////////////////////////
void Specialization(bool special)
{
	if (special = true)
	{
		for (int i = 0; i < 4; i++)
		{
			itemDamage[i + 3] += 1;
			itemDamage[i + 7] -= 1;
			eqipDamage[i]--;
			eqipDamage[i+4]++;

		}

		for (int i = 0; i < 5; i++)
		{

			skils[i] = magSkils[i];
		}

	}
	else {
		for (int i = 0; i < 4; i++)
		{
			
			itemDamage[i + 3] -= 1;
			itemDamage[i + 7] += 1;
			eqipDamage[i]++;
			eqipDamage[i + 4]--;
		}
		itemDamage[0]++;
		for (int i = 0; i < 5; i++)
		{
			skils[i] = ratSkils[i];
		}
	}

}
void Fight(int mobHeals, int mobDamage){
	int choice;
    rechoice:
	TextWindow();
  //cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
	cout << "\t|                                                                                                  |" << endl << "\t|";
	cout <<"\t|"<< mobName << " грозный противник. Так как ты застал его в расплох, то ходи первым!\n";
	cout << "\t|                                                                                                  |" << endl;
	cout << "\t| Выбери действие :                                                                                |" << endl;
	cout << "\t| 1) "<<skils[0]<<endl;
	cout << "\t| 2) Использовать навыки.                                                                          |" << endl;
	cout << "\t| 3) Использовать инвернтарь.                                                                      |" << endl;
	cout << "\t| 4) Бежать.                                                                                       |" << endl;
	TextWindow();
	cout << "\n\t\tВведите свой выбор : ";
	cin >> choice;
	switch (choice)
	{
	case 1:

		cout << "\n\t\tВы наносите цели - " << mobName << " " << skils[0] << " и причияете " << skilsDamage[0] << " урона!";
		if (mobHeals>0)
		{
			playerHels -= mobDamage;
		}
		else {
			cout << "\n\tПозравляем! " << mobName << " сражен!";
			expirience += mobExp;
			if (expirience>9)
			{
				lvl++;
				skilsDamage[0]++;
			}
		}

	case 2:
		//Выберите навык : скил 1 скил 2 скил 3 скил 4
	case 3:
	case 4:
	default:
		break;
	}
}


void Action() {

	cout << endl;
	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
	cout << "\t|                                                                                                  |" << endl << "\t|";
	cout << "\tСделай выбор!!!                                                                            |" << endl << "\t|";
	cout << "\t1) Идти на Север.                                                                          |" << endl << "\t|";
	cout << "\t2) Идти на Запад.                                                                          |" << endl << "\t|";
	cout << "\t3) Идти на Восток.                                                                         |" << endl << "\t|";

}


//Комнаты!!!
void Chest() {
	
	system("cls");
	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_|23456789_123|5678|__|"; - 'это разметка текста. Выровняй разметку по cout.
	cout << "\t|                                                                                                  |";
	cout << "\n\t|\tОтлично " << playerName << ", отакрыть сундук отличная идея, надеюсь у тебя есть ключ?. " << endl << "\t|";
	cout << "                                                                                                  |" << endl << "\t|";
	cout << "\tТы шаришь по карманам в поисках ключа...                                                   |" << endl << "\t|";
	if (key > 0) {
		GenerateItem();
		cout << "                                                                                                  |" << endl << "\t|";
		cout << "\tШикарно, вы нашли ключ!                                                                    |" << endl << "\t|";
		cout << "                                                                                                  |" << endl << "\t|";
		cout << "Теперь посмотрим чем вам удалось поживится. Тяжелая крышка старого сундука, со скрипом отворяется.|" << endl << "\t|";
		cout << "Вы неможите поверить своим глазам, вы нашли -\"" << sayItem <<"\""<< endl << "\t| ";
		cout << "                                                                                                 |" << endl;
		TextWindow();
		key -= 1;
		chekCloseChest[savePosition] = false;
		setNavigation = savePosition;
		system("pause");
		system("cls");
		Navigation();

	}
	else {
		
		
	  //cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_|23456789_123|5678|__|"; - 'это разметка текста. Выровняй разметку по cout.
		cout << "                                                                                                  |" << endl << "\t|";
		cout << "\tПошарив по карманам, вы понимаете, что ключа у вас так и нет!                              |" << endl << "\t|";
		cout << "\tВаши попытки тщетны и вы остаетесь ни с чем!                                               |" << endl << "\t|";
		cout << "\tХорошо, хоть сундук не обратился монстром...                                               |" << endl << "\t|";
		cout << "                                                                                                  |" << endl;
		TextWindow();
		
		setNavigation = savePosition;
		system("pause");
		system("cls");
		Navigation();
	}

}

void Room_Clear_Center() {

	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
	cout << "Если ты попал сюда, то чо то не так.";
	system("pause");
	system("cls");
}
void Room_Clear_Left() {

	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#','*','*','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
	cout << "Если ты попал сюда, то чо то не так.";
	system("pause");
	system("cls");
}
void Room_Clear_Right() {

	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#','*','*','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";

	}
	cout << "Если ты попал сюда, то чо то не так.";
	system("pause");
	system("cls");
}
void Room_A1() {
	savePosition = 1;
	mobName = "Приведение";
	mobExp = 1;
	system("cls");
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#','*','*','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ','*','#','*',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ',' ',' ','#',' ',' ',' ',' ',' ','*','#','#','#','*',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ',' ','#',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#','#','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
	cout << endl;
	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
	cout << "\t|                                                                                                  |" << endl << "\t|";
	cout << "\tВорвавшись в эту комнату ты натыкаешься на "<< mobName<<"! Очень жаль "<< playerName<< "." << endl;
	cout << "\t|Тебе придется сражаться!                                                                          |" << endl;
	cout << "\t|                                                                                                  |" << endl;
	TextWindow();

rechoice:
	Fight(2,1);
	Interface();

	cout << endl << endl << "\t\t\t\t\tСделайте выбор : ";
	cin >> choice;
	switch (choice) {
	case 1:
		setNavigation = 5;
		break;
	case 2:
		setNavigation = 1;
		break;
	case 3:
		setNavigation = 3;
		break;
	case 4:
		if (chekCloseChest[2] == true) {
			setNavigation = 0;

		}
		else {

			cout << "\n\n\t\t\t\t Э-э-э, вообщето вы уже открывали сундук. Выберите, что ни будь другое!";
			goto rechoice;
		}
		break;
	default:
		break;
	}
	Navigation();
	
}
void Room_A2() {
	savePosition = 2;
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ','#','*','*','*','#',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ','#',' ',' ','*',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ','#','#','#','#','#','#','#',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ','#',' ',' ','V',' ',' ','#',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
	cout << endl;
	TextWindow();
	//cout << "123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123456789_123|5678|__|"; - 'это разметка текста.
	cout << "\t|                                                                                                  |" << endl << "\t|";
	cout << "\tВорвавшись в эту комнату ты наблюдаешь лишь сундук. Если есть ключ, попытай счастье!     |" << endl;
	cout << "\t|                                                                                                  |" << endl;
	TextWindow();

rechoice:
	Action();
	cout << "\t4) Открыть сундук!                                                                         |" << endl << "\t";
	cout << "|                                                                                                  |" << endl;
	TextWindow();
	Interface();

	cout <<endl<<endl<< "\t\t\t\t\tСделайте выбор : ";
	cin >> choice;
	switch (choice) {
	case 1:
		setNavigation = 5;
		break;
	case 2:
		setNavigation = 1;
		break;
	case 3:
		setNavigation = 3;
		break;
	case 4:
		if (chekCloseChest[2] == true) {
			setNavigation = 0;
			
		}
		else {
			
			cout << "\n\n\t\t\t\t Э-э-э, вообщето вы уже открывали сундук. Выберите, что ни будь другое!";
			goto rechoice;
		}
		break;
	default:
		break;
	}
	Navigation();
}
void Room_A3() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A4() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A5() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A6() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A7() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A8() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A9() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A10() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
	cout << "Если ты попал сюда, то чо то не так.";
	system("pause");
	system("cls");
}
void Room_A11() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A12() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A13() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A14() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
}
void Room_A15() {
	char room[27][25]{

		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#' },
		{ '#',' ',' ','*',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ','*',' ',' ','#' },
		{ '#',' ',' ',' ','*',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ','*',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','/','|','\\',' ',' ',' ',' ','*',' ',' ',' ',' ',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ',' ',' ',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ','#',' ','#','#','#','#','#',' ','#',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ','*','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ','#',' ','#',' ',' ',' ','#',' ','#',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','*','#',' ',' ','#','#','#','#','#','#','#','#','#',' ',' ','#','*',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ','*',' ',' ',' ',' ',' ',' ',' ',' ',' ','*',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ','#' },
		{ '#',' ','#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#',' ','#' },
		{ '#',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ','#' },
		{ '#',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#' },
		{ '#','*',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','*','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#' },
		{ '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#' }
	};


	cout << "\t\t\t\t\t";
	for (int t = 0; t < 27; t++)
	{
		for (int i = 0; i < 25; i++)
		{
			cout << room[t][i];
		}
		cout << endl << "\t\t\t\t\t";
	}
	cout << "Если ты попал сюда, то чо то не так.";
	system("pause");
	system("cls");
}


//закончились комнаты!!
